<a href="https://colab.research.google.com/github/Ayanlola2002/Stutern/blob/master/Copy_of_Feature_Engineering_Session_Take_Home_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Instructions**
Please make a copy of this notebook first and then answer the questions in your own copy.

**To make a copy of the notebook:**
- Click on **`File`**
- Click on  **`Save a copy in Drive`**
- Work from that saved file.

**Another alternative would be to:**
- Download the notebook and the data file
- Work on it from your computer
- Reupload your solution notebook to [Google's Colaboratory](https://colab.research.google.com/) so I can leave comments on it.


**Please ensure that you have run all the cells of your submission notebook so I'll be able to see your results without having to run them myself.** 

Thank you!!!

# **How to get the Data file**
The exercises here are based on the Training Titanic dataset which was available on Kaggle [here](https://www.kaggle.com/c/titanic/data) during the Titanic competition. This is possibly one of the most popular dataset available online. The goal of the competiotion was to **Predict those who'd survive on the Titanic**

**Note:**
If you are getting the data from Kaggle, you'll need to **JOIN** the competition before you can access the data.

You can also download it directly from google drive through this [link](https://drive.google.com/file/d/1Eipec9zf0NNiM4WsLqVGqMh_Tr1Ee6Vk/view?usp=sharing)

# **Import Pandas and read in the CSV File**
*You can also do all other library imports here*

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
from sklearn import preprocessing
from sklearn.preprocessing import Binarizer
import re

file_path ="/content/kaggle_titanic_train_data.csv"
df = pd.read_csv(file_path)

# **Check to see how the data looks like**
**Hint:** You need a Pandas function for this

***Your solution:***

In [38]:
# Your solution goes in here
df.head()
#print (df)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

# **Data Cleanup Exercises**
Use the appropriate pandas function or method to perform the tasks below

## **1. Replace male/female with boolean values**
Boolean values are binary values. You can use 1/0 or True/False.

In [39]:
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [0]:
# Your solution goes in here
def ConvertSex2_Binary(desc):
  Sex={
      'male':1,
       'female':0
      }
  return Sex[desc]

df['Sex']=df['Sex'].apply(ConvertSex2_Binary)

In [41]:
df['Sex'].head()

0    1
1    0
2    0
3    0
4    1
Name: Sex, dtype: int64

## **2. Fill any missing age values with the average age of the passengers**

In [0]:
# Your solution goes in here
df['Age']=df['Age'].fillna((df['Age'].mean()))

In [43]:
#checking if age column still contains nan
df['Age'].isnull().sum()

0

## **3. Use a Regex expression on the `Ticket` column to get just the ticket numbers attached to the ticket**


**`A/5 21171`** should now be represented as **`21171`**

In [44]:
# Your solution goes in here
#df['Ticket']=df['Ticket'].str.extract('(\d+)').astype(str)
df['Ticket'].str.extract('(\d+)').astype(str)

          0
0         5
1     17599
2         2
3    113803
4    373450
..      ...
886  211536
887  112053
888    6607
889  111369
890  370376

[891 rows x 1 columns]

In [45]:
df['Ticket'] = df['Ticket'].apply(lambda x: re.search(r'\d+', x.group(0)))

AttributeError: ignored

In [46]:
#checking the ticket number
df.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN         S
1            2         1       1  ...  71.2833    C85         C
2            3         1       3  ...   7.9250    NaN         S
3            4         1       1  ...  53.1000   C123         S
4            5         0       3  ...   8.0500    NaN         S

[5 rows x 12 columns]

## **4. Use the Sklearn `Binarizer` on the `Fare` Column**
Any value **less than 40** should belong to the **`0`** class, and values **greater than 40** should belong to the **`1`** class.*italicized text*

In [0]:
# Your solution goes in here
from sklearn.preprocessing import Binarizer 
binarizer_age= Binarizer(40) 
x=df['Fare'].values.reshape(-1,1)
b=binarizer_age.fit_transform(x)
df['Fare']=pd.DataFrame(b)

In [49]:
df['Fare'].head()

0    0.0
1    1.0
2    0.0
3    1.0
4    0.0
Name: Fare, dtype: float64

## **5. Extract the titles from the names and add it to the dataframe as a new column**
Titles in the name column are **Mr., Mrs., Miss.**, etc. Extract the title from the name and add it into a new column. The column should only include Mr, Mrs, Miss, etc.

**Hints:** You may need to separate the work into several lines of code. You may need to string together several functions like **apply(), split(), lambda**. Check the python documentation to learn more about each function.

In [0]:
# Your solution goes in here
def get_title(col):
    """
    Use a regular expression to search for a title.  Titles always consist of
    capital and lowercase letters, and end with a period.
    
    This line Takes a dataframe colunm as input and returns the title string as output
    """

    title_search = re.search(' ([A-Za-z]+)\.',col)
    # If the title exists, extract and return it.
    if title_search:
        return title_search.group(1)
    return ""


df['Title']=df['Name'].apply(get_title)

You can refer back to the Notebook from my session [here](https://colab.research.google.com/drive/1dmMKVs2uOJIVuOF3G2RavLnebkwIQ_RN)

# **Resources**

**Here's a list of some resources that'll help with Feature Engineering:**
- [Feature Engineering Made Easy](https://github.com/PacktPublishing/Feature-Engineering-Made-Easy)
- [Tips Of Feature Engineering](https://github.com/Pysamlam/Tips-of-Feature-engineering)
- [Awesome Feature Engineering for Machine Learning](https://github.com/aikho/awesome-feature-engineering)